Repository: visaplan/plone.ajaxnavigation
Catalog: src/visaplan/plone/ajaxnavigation/locales/*/LC_MESSAGES/visaplan.plone.ajaxnavigation.po
Languages: de

source: AJAX navigation settings
de: Konfiguration der AJAX-Navigation

source: AJAX response key
de: AJAX-Antwortschlüssel

source: AJAX view
de: AJAX-Sicht

source: Access denied
de: Zugriff verweigert

source: Access denied: ${title}
de: Zugriff verweigert: ${title}

source: Active areas
de: Aktive Bereiche

source: Attributes
de: Attribute

source: Blacklist
de: Ausschlußliste

source: Blacklist class IDs
de: Ausschlußliste für "a"-Klassen

source: Blacklist class prefixes
de: Ausschlußliste für Klassenpräfixe

source: Blacklist class suffixes
de: Ausschlußliste für Klassensuffixe

source: Blacklist view IDs
de: Ausschlußliste für Bezeichner von Sichten

source: Blacklist view prefixes
de: Präfixe auszuschließender Sichten

source: Blacklist view suffixes
de: Suffixe auszuschließender Sichten

source: CSS selector
de: CSS-Selektor

source: CSS selector[,...]
de: CSS-Selektor[,...]

source: Child objects
de: Kindobjekte

source: Default key for the @scrollto @auto value
de: Schlüsselvorgabe für den @scrollto-Wert „@auto“

source: Default selector for the @scrollto feature
de: Selektor-Vorgabe für @scrollto

source: Default vertical offset for the @scrollto feature
de: Vertikaler Versatz für @scrollto

source: Development mode
de: Entwicklungsmodus

source: Development support
de: Entwicklungsunterstützung

source: Internal processing
de: Interne Verarbeitung

source: Layouts for AJAX
de: Layouts für AJAX

source: Menu processing
de: Menüverarbeitung

source: Nested blacklist
de: Verschachtelte Ausschlußliste

source: Other exceptions
de: Andere Ausnahmen

source: Please login
de: Bitte anmelden

source: Please login: ${title}
de: Bitte anmelden: ${title}

source: Regard target attribute
de: target-Attribute beachten

source: Security
de: Sicherheit

source: Selector menu items
de: Selektor für Menüpunkte

source: Selectors
de: Selektoren

source: Selectors for data keys
de: Selektoren für Datenschlüssel

source: Settings for the visaplan.plone.ajaxnavigation package
de: Konfiguration des Pakets visaplan.plone.ajaxnavigation

source: Switched classname
de: Umgeschaltete CSS-Klasse

source: View IDs
de: Sichten-Bezeichner

source: View id recognition
de: Erkennung von Sichten

source: View prefixes
de: Präfixe für Sichten-Bezeichner

source: View suffixes
de: Suffixe für Sichten-Bezeichner

source: Views for AJAX
de: AJAX-Sichten

source: Whitelist
de: Positivliste

source: class id
de: Klassenname

source: class prefix
de: Klassenpräfix

source: class suffix
de: Klassensuffix

source: full-page layout
de: Vollseiten-Layout

source: help_blacklist
de: CSS-Selektoren für Seitenbereiche, in denen die Konversion von a-Elementen für die AJAX-Navigation unterdrückt werden soll

source: help_blacklist_class_ids
de: Für bestimmte Klassen von "a"-Elementen sollen möglicherweise andere Aktionen ausgeführt werden, z. B. die Darstellung von Bildern in einer Lightbox.

source: help_blacklist_class_prefixes
de: Sie haben möglicherweise eine Familie von "a"-Elemente mit Klassen mit einem gemeinsamen Präfix, die von der Ajax-Navigation nicht verarbeitet werden dürfen.

source: help_blacklist_class_suffixes
de: Sie haben möglicherweise eine Familie von "a"-Elemente mit Klassen mit einem gemeinsamen Suffix, die von der Ajax-Navigation nicht verarbeitet werden dürfen.

source: help_blacklist_view_ids
de: Bei der Berechnung der (maximal zwei) zu probierenden URLs werden die hier aufgeführten Werte als Bezeicher von Sichten erkannt, für die keine AJAX-Ansteuerung versucht werden soll.

source: help_blacklist_view_prefixes
de: Wenn das letzte Pfadsegment einer URL mit einem der hier angegebenen Werte beginnt, wird es als Name einer Sicht betrachtet, für die keine AJAX-Ansteuerung versucht werden soll.

source: help_blacklist_view_suffixes
de: Wenn das letzte Pfadsegment einer URL mit einem der hier angegebenen Werte endet, wird es als Name einer Sicht betrachtet, für die keine AJAX-Ansteuerung versucht werden soll.

source: help_development_mode
de: Im Entwicklungsmodus werden h1-Überschriften farbig umrandet. Sie können wählen zwischen „on“ (eingeschaltet), „off“ (aus) und „auto“; bei „auto“ gibt dieser Wert den „DevelopmentMode“ der Zope-Instanz wieder.

source: help_layout4ajax
de: Insbesondere bei Ordnern können unterschiedliche Layouts aktiviert sein. Für jedes „normale“ (Vollseiten-) Layout kann hier eine AJAX-Version konfiguriert werden.

source: help_menu_item_selector
de: Beim Laden von Seiteninhalten per Ajax kommt es vor, daß der Kontext des aktuell hervorgehobenen Hauptmenüpunkts verlassen wird. Das Hauptmenü muß daher (anhand der aktuellen URL) aktualisiert werden.

source: help_menu_item_switched_classname
de: Der Name einer CSS-Klasse, die dem aktuell hervorzuhebenden Menüpunkt hinzugefügt und allen anderen auf den Selektor "main_item_selector" passenden Menüpunkten entzogen wird

source: help_nested_blacklist
de: Wenn aktiviert, und wenn es eine nicht-leere Ausschlußliste von CSS-Selektoren gibt, wird diese während der Abarbeitung der Positivliste angewendet

source: help_scrollto_auto_key
de: Wenn der @scrollto-Wert „@auto“ konfiguriert ist, verwende den Selektor für den hier angegebenen Schlüssel (Vorgabe: „content“; wenn hier also „content“ konfiguriert ist, und der Selektor für „content“ ist „#content“, wird nach dem Laden der Inhalte „#content“ angesteuert (mittels der „scrollTop“-Methode von jQuery).

source: help_scrollto_default_selector
de: Wenn Inhalte nachgeladen werden durch Klick auf einen Verweis im unteren Bereich einer Seite, kann es vorkommen, daß dies unbemerkt bleibt. Um dies zu verhindern, gehen wir nach oben; entweder an den Seitenanfang oder zum (mutmaßlich soeben aktualisierten) Element, das durch den hier konfigurierten Selektor angegeben wird. Sie können den speziellen Wert „@auto“ verwenden.

source: help_selectors
de: Für jeden „normalen“ Schlüssel der AJAX-Antwort benötigen wir einen CSS-Selektor mit der Angabe, wohin sein Wert geschrieben werden soll. Sie können jeweils mehr als einen Wert angeben, durch Komma getrennt; diese werden in der angegebenen Reihenfolge probiert.

source: help_view4ajax
de: Für jeden „portal_type“ können wir eine AJAX-Version der normalen Vollseitenansicht konfigurieren.

source: help_view_ids
de: Bei der Berechnung der (maximal zwei) zu probierenden URLs werden die hier aufgeführten Werte (nach dem letzten „/“ der Pfadkomponente, natürlich) als Bezeicher von Sichten erkannt.

source: help_view_prefixes
de: Wenn das letzte Pfadsegment einer URL mit einem der hier angegebenen Werte beginnt, wird es als Name einer Sicht betrachtet.

source: help_view_suffixes
de: Wenn das letzte Pfadsegment einer URL mit einem der hier angegebenen Werte endet, wird es als Name einer Sicht betrachtet.

source: help_whitelist
de: CSS-Selektoren für Seitenbereiche, in denen die Konversion von a-Elementen für die AJAX-Navigation angewendet werden soll

source: portal_type
de: Portaltyp

source: rel value
de: rel-Wert

source: rel values for a[target] links
de: rel-Werte für a-Elemente mit target-Attribut

source: view id
de: Sicht-Bezeichner

source: view prefix
de: Sicht-Präfix

source: view suffix
de: Sicht-Suffix
